tests/load/load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Spike test"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./load-processor.js"

scenarios:
  - name: "Authentication Flow"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            registration_number: "{{ $randomString() }}"
            password: "{{ $randomString() }}"
          capture:
            - json: "$.data.token"
              as: "accessToken"
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"

  - name: "Public Endpoints"
    flow:
      - get:
          url: "/api/timetable/terms"
      - get:
          url: "/health"

  - name: "Admin Endpoints"
    weight: 1
    flow:
      - post:
          url: "/api/auth/login"
          json:
            registration_number: "admin001"
            password: "TestAdmin123!"
          capture:
            - json: "$.data.token"
              as: "adminToken"
      - get:
          url: "/api/terms"
          headers:
            Authorization: "Bearer {{ adminToken }}"